# ColumnTopBelowBaseError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ColumnFailures..::..ColumnTopBelowBaseError Property
BuiltInFailures..::..ColumnFailures Class See Also
---
The column top can't be moved below its base.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ColumnTopBelowBaseError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ColumnTopBelowBaseError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ColumnTopBelowBaseError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ColumnFailures Class
Autodesk.Revit.DB Namespace